avr-rust/avrd/packs/xmegac/ATxmega384C3.atdf
          <instance name="TCF0">
            <register-group address-space="data" offset="0xB00" name-in-module="TC0" name="TCF0"/>
            <signals>
              <signal function="TC0" group="OC0A" pad="PF0"/>
              <signal function="TC0" group="OC0B" pad="PF1"/>
              <signal function="TC0" group="OC0C" pad="PF2"/>
              <signal function="TC0" group="OC0D" pad="PF3"/>
            </signals>
          </instance>
        </module>
        <module name="TC2" id="I6090" version="XMEGAD">
          <instance name="TCC2">
            <register-group address-space="data" offset="0x800" name-in-module="TC2" name="TCC2"/>
            <signals>
              <signal function="TC2" group="LOC2A" pad="PC0"/>
              <signal function="TC2" group="LOC2B" pad="PC1"/>
              <signal function="TC2" group="LOC2C" pad="PC2"/>
              <signal function="TC2" group="LOC2D" pad="PC3"/>
              <signal function="TC2" group="HOC2A" pad="PC4"/>
              <signal function="TC2" group="HOC2B" pad="PC5"/>
              <signal function="TC2" group="HOC2C" pad="PC6"/>
              <signal function="TC2" group="HOC2D" pad="PC7"/>
            </signals>
          </instance>
          <instance name="TCD2">
            <register-group address-space="data" offset="0x900" name-in-module="TC2" name="TCD2"/>
            <signals>
              <signal function="TC2" group="LOC2A" pad="PD0"/>
              <signal function="TC2" group="LOC2B" pad="PD1"/>
              <signal function="TC2" group="LOC2C" pad="PD2"/>
              <signal function="TC2" group="LOC2D" pad="PD3"/>
              <signal function="TC2" group="HOC2A" pad="PD4"/>
              <signal function="TC2" group="HOC2B" pad="PD5"/>
              <signal function="TC2" group="HOC2C" pad="PD6"/>
              <signal function="TC2" group="HOC2D" pad="PD7"/>
            </signals>
          </instance>
          <instance name="TCE2">
            <register-group address-space="data" offset="0xA00" name-in-module="TC2" name="TCE2"/>
            <signals>
              <signal function="TC2" group="LOC2A" pad="PE0"/>
              <signal function="TC2" group="LOC2B" pad="PE1"/>
              <signal function="TC2" group="LOC2C" pad="PE2"/>
              <signal function="TC2" group="LOC2D" pad="PE3"/>
              <signal function="TC2" group="HOC2A" pad="PE4"/>
              <signal function="TC2" group="HOC2B" pad="PE5"/>
              <signal function="TC2" group="HOC2C" pad="PE6"/>
              <signal function="TC2" group="HOC2D" pad="PE7"/>
            </signals>
          </instance>
          <instance name="TCF2">
            <register-group address-space="data" offset="0xB00" name-in-module="TC2" name="TCF2"/>
            <signals>
              <signal function="TC2" group="LOC2A" pad="PF0"/>
              <signal function="TC2" group="LOC2B" pad="PF1"/>
              <signal function="TC2" group="LOC2C" pad="PF2"/>
              <signal function="TC2" group="LOC2D" pad="PF3"/>
              <signal function="TC2" group="HOC2A" pad="PF4"/>
              <signal function="TC2" group="HOC2B" pad="PF5"/>
              <signal function="TC2" group="HOC2C" pad="PF6"/>
              <signal function="TC2" group="HOC2D" pad="PF7"/>
            </signals>
          </instance>
        </module>
        <module name="AWEX" id="I6090" version="XMEGAAU">
          <instance name="AWEXC">
            <register-group address-space="data" offset="0x880" name-in-module="AWEX" name="AWEXC"/>
            <signals>
              <signal function="AWEX" group="OC0ALS" pad="PC0"/>
              <signal function="AWEX" group="OC0AHS" pad="PC1"/>
              <signal function="AWEX" group="OC0BLS" pad="PC2"/>
              <signal function="AWEX" group="OC0BHS" pad="PC3"/>
              <signal function="AWEX" group="OC0CLS" pad="PC4"/>
              <signal function="AWEX" group="OC0CHS" pad="PC5"/>
              <signal function="AWEX" group="OC0DLS" pad="PC6"/>
              <signal function="AWEX" group="OC0DHS" pad="PC7"/>
            </signals>
          </instance>
        </module>
        <module name="HIRES" id="I6090" version="XMEGAAU">
          <instance name="HIRESC">
            <register-group address-space="data" offset="0x890" name-in-module="HIRES" name="HIRESC"/>
          </instance>
        </module>
        <module name="USART" id="I6090" version="XMEGAAU">
          <instance name="USARTC0">
            <register-group address-space="data" offset="0x8A0" name-in-module="USART" name="USARTC0"/>
            <signals>
              <signal field="USART0" function="USART" group="XCK" pad="PC1"/>
              <signal field="USART0" function="USART" group="RXD" pad="PC2"/>
              <signal field="USART0" function="USART" group="TXD" pad="PC3"/>
              <signal field="USART0" function="USART_ALT" group="XCK" pad="PC5"/>
              <signal field="USART0" function="USART_ALT" group="RXD" pad="PC6"/>
              <signal field="USART0" function="USART_ALT" group="TXD" pad="PC7"/>
            </signals>
          </instance>
          <instance name="USARTD0">
            <register-group address-space="data" offset="0x9A0" name-in-module="USART" name="USARTD0"/>
            <signals>
              <signal function="USART" group="XCK" pad="PD1"/>
              <signal function="USART" group="RXD" pad="PD2"/>
              <signal function="USART" group="TXD" pad="PD3"/>
            </signals>
          </instance>
          <instance name="USARTE0">
            <register-group address-space="data" offset="0xAA0" name-in-module="USART" name="USARTE0"/>
            <signals>
              <signal function="USART" group="XCK" pad="PE1"/>
              <signal function="USART" group="RXD" pad="PE2"/>
              <signal function="USART" group="TXD" pad="PE3"/>
            </signals>
          </instance>
        </module>
        <module name="SPI" id="I6090" version="XMEGAAU">
          <instance name="SPIC">
            <register-group address-space="data" offset="0x8C0" name-in-module="SPI" name="SPIC"/>
            <signals>
              <signal field="SPI" function="SPI" group="SS" pad="PC4"/>
              <signal field="SPI" function="SPI" group="MOSI" pad="PC5"/>
              <signal field="SPI" function="SPI" group="MISO" pad="PC6"/>
              <signal field="SPI" function="SPI" group="SCK" pad="PC7"/>
              <signal field="SPI" function="SPI_ALT" group="SS" pad="PC4"/>
              <signal field="SPI" function="SPI_ALT" group="SCK" pad="PC5"/>
              <signal field="SPI" function="SPI_ALT" group="MISO" pad="PC6"/>
              <signal field="SPI" function="SPI_ALT" group="MOSI" pad="PC7"/>
            </signals>
          </instance>
